import { CbrPpFields } from "./cbr-pp-props";

export const names: CbrPpFields[] = [
  "СекцияДокумент",
  /**003 Номер*/
  "Номер",
  /**004 Дата*/
  "Дата",
  /**007 Сумма*/
  "Сумма",
  /**006 СуммаПрописью*/
  "СуммаПрописью",
  /**009 ПлательщикСчет*/
  "ПлательщикСчет",
  /**071 ДатаСписано*/
  "ДатаСписано",
  /**008 Плательщик*/
  "Плательщик",
  "Плательщик1",
  /**060 ПлательщикИНН*/
  "ПлательщикИНН",
  /**102 ПлательщикКПП*/
  "ПлательщикКПП",
  /**009 ПлательщикРасчСчет*/
  "ПлательщикРасчСчет",
  /**010 Банк плательщика */
  "ПлательщикБанк1",
  "ПлательщикБанк2",
  /**011 ПлательщикБИК*/
  "ПлательщикБИК",
  /**012 ПлательщикКорсчет*/
  "ПлательщикКорсчет",
  //"ПолучательСчет"?: string , undefined;
  /**062 ДатаПоступило*/
  "ДатаПоступило",
  "Получатель",
  "Получатель1",
  /**061 ПолучательИНН*/
  "ПолучательИНН",
  /**103 ПолучательКПП*/
  "ПолучательКПП",
  /**017 ПолучательРасчСчет*/
  "ПолучательРасчСчет",
  "ПолучательСчет",
  /**013 ПолучательБанк1*/
  "ПолучательБанк1",
  "ПолучательБанк2",
  /**014 ПолучательБИК*/
  "ПолучательБИК",
  /**015 ПолучательКорсчет*/
  "ПолучательКорсчет",
  /**005 ВидПлатежа*/
  "ВидПлатежа",
  /**018 ВидОплаты Вид Операции*/
  "ВидОплаты",
  /**101 */
  "СтатусСоставителя",
  /**104 ПоказательКБК*/
  "ПоказательКБК",
  /**105 ОКТМО */
  "ОКАТО",
  /**106  ПоказательОснования*/
  "ПоказательОснования",
  /**107 ПоказательПериода*/
  "ПоказательПериода",
  /**108 ПоказательНомера*/
  "ПоказательНомера",
  /**109 ПоказательДаты*/
  "ПоказательДаты",
  /**110  ПоказательТипа*/
  "ПоказательТипа",
  /**021  Очередность*/
  "Очередность",
  /**024 НазначениеПлатежа*/
  "НазначениеПлатежа",
  "НазначениеПлатежа1",
  "НазначениеПлатежа2",
  /**019 СрокПлатежа*/
  "СрокПлатежа",
  /**020 КодНазПлатежа Назначение платежа кодовое */
  "КодНазПлатежа",
  /**022 Код Уникальный идентификатор платежа*/
  "Код",
  "КонецДокумента",
];